particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "device_code.h"
#include "system_error.h"
#include "sdk_config_system.h"
#include "spark_wiring_vector.h"
#include "simple_pool_allocator.h"
#include <string.h>


using spark::Vector;


#define BLE_CONN_CFG_TAG                            1
#define BLE_OBSERVER_PRIO                           1

#define BLE_DISCOVERY_PROCEDURE_IDLE                0x00
#define BLE_DISCOVERY_PROCEDURE_SERVICES            0x01
#define BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS     0x02
#define BLE_DISCOVERY_PROCEDURE_DESCRIPTORS         0x03

#define BLE_GENERAL_PROCEDURE_TIMEOUT               5000 // In milliseconds
#define BLE_DICOVERY_PROCEDURE_TIMEOUT              15000 // In milliseconds

#define BLE_MAX_EVT_CB_COUNT                        2

#define NRF_CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return sysError(_ret); \
            } \
        } while (false)

#define NRF_CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
            } \
        } while (false)

#define CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return _ret; \
            } \
        } while (false)


#define CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return; \
            } \
        } while (false)


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};

typedef struct {
    hal_ble_evts_t arg;
} HalBleEvtMsg_t;

typedef struct {
    on_ble_evt_cb_t handler;
    void* context;
} HalBleEvtCb_t;

typedef struct {
    uint16_t       discStartHandle;
    uint16_t       discEndHandle;
    hal_ble_svc_t  services[BLE_MAX_SVC_COUNT];
    hal_ble_char_t characteristics[BLE_MAX_CHAR_COUNT];
    hal_ble_desc_t descriptors[BLE_MAX_DESC_COUNT];
    uint8_t        discAll : 1;
    uint8_t        count;
    uint8_t        currIndex;
    uint8_t        currDiscProcedure;
    os_semaphore_t semaphore;
} HalBleDiscovery_t;

/* BLE Instance */
typedef struct {
    uint8_t  initialized  : 1;
    uint8_t  discovering  : 1;
    os_semaphore_t discoverySemaphore;
    os_semaphore_t readWriteSemaphore;
    os_queue_t     evtQueue;
    os_thread_t    evtThread;

    ble_gap_addr_t        whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_gap_addr_t const* whitelistPointer[BLE_MAX_WHITELIST_ADDR_COUNT];

    HalBleDiscovery_t     discovery;

    uint16_t readAttrHandle;
    uint8_t  readData[20];
    uint16_t readDataLen;

    HalBleEvtCb_t evtCbs[BLE_MAX_EVT_CB_COUNT];
} HalBleInstance_t;


static HalBleInstance_t s_bleInstance = {
    .initialized  = 0,
    .discovering  = 0,

    .discoverySemaphore = NULL,
    .readWriteSemaphore = NULL,
    .evtQueue  = NULL,
    .evtThread = NULL,
};


static system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:                       return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:           return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:           return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:                return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:                  return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:               return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:                    return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:                 return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:                    return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:              return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:               return SYSTEM_ERROR_ABORTED;
        default:                                return SYSTEM_ERROR_UNKNOWN;
    }
}

static int toPlatformUUID(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid) {
    if (uuid == NULL || halUuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (halUuid->type == BLE_UUID_TYPE_128BIT) {
        ble_uuid128_t uuid128;
        memcpy(uuid128.uuid128, halUuid->uuid128, BLE_SIG_UUID_128BIT_LEN);
        ret_code_t ret = sd_ble_uuid_vs_add(&uuid128, &uuid->type);
        NRF_CHECK_RETURN(ret, "sd_ble_uuid_vs_add");
        ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, halUuid->uuid128, uuid);
        NRF_CHECK_RETURN(ret, "sd_ble_uuid_decode");
    }
    else if (halUuid->type == BLE_UUID_TYPE_16BIT) {
        uuid->type = BLE_UUID_TYPE_BLE;
        uuid->uuid = halUuid->uuid16;
    }
    else {
        uuid->type = BLE_UUID_TYPE_UNKNOWN;
        uuid->uuid = halUuid->uuid16;
    }
    return SYSTEM_ERROR_NONE;
}

static int toHalUUID(const ble_uuid_t* uuid, hal_ble_uuid_t* halUuid) {
    if (uuid == NULL || halUuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (uuid->type == BLE_UUID_TYPE_BLE) {
        halUuid->type = BLE_UUID_TYPE_16BIT;
        halUuid->uuid16 = uuid->uuid;
        return SYSTEM_ERROR_NONE;
    }
    else if (uuid->type != BLE_UUID_TYPE_UNKNOWN) {
        uint8_t uuidLen;
        halUuid->type = BLE_UUID_TYPE_128BIT;
        ret_code_t ret = sd_ble_uuid_encode(uuid, &uuidLen, halUuid->uuid128);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_encode() failed: %u", (unsigned)ret);
            halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
            halUuid->uuid16 = uuid->uuid;
            return sysError(ret);
        }
        return SYSTEM_ERROR_NONE;
    }

