particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
    halUuid->uuid16 = uuid->uuid;

    return SYSTEM_ERROR_UNKNOWN;
}

uint8_t toHalCharProps(ble_gatt_char_props_t properties) {
    uint8_t halProperties = 0;
    if (properties.broadcast) halProperties |= BLE_SIG_CHAR_PROP_BROADCAST;
    if (properties.read) halProperties |= BLE_SIG_CHAR_PROP_READ;
    if (properties.write_wo_resp) halProperties |= BLE_SIG_CHAR_PROP_WRITE_WO_RESP;
    if (properties.write) halProperties |= BLE_SIG_CHAR_PROP_WRITE;
    if (properties.notify) halProperties |= BLE_SIG_CHAR_PROP_NOTIFY;
    if (properties.indicate) halProperties |= BLE_SIG_CHAR_PROP_INDICATE;
    if (properties.auth_signed_wr) halProperties |= BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES;
    return halProperties;
}

uint8_t toPlatformCharProps(uint8_t halProperties, ble_gatt_char_props_t* properties) {
    memset(properties, 0x00, sizeof(ble_gatt_char_props_t));
    properties->broadcast = (halProperties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
    properties->read = (halProperties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
    properties->write_wo_resp = (halProperties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
    properties->write = (halProperties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
    properties->notify = (halProperties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
    properties->indicate = (halProperties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
    properties->auth_signed_wr = (halProperties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
    return 0;
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    HalBleEvtMsg_t  msg;
    memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_PHY_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical updated.");
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length updated.");
            LOG_DEBUG(TRACE, "| txo    rxo     txt(us)     rxt(us) |.");
            LOG_DEBUG(TRACE, "  %d    %d     %d        %d",
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length update request.");

            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, NULL);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: security parameters request.");

            // Pairing is not supported
            ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_AUTH_STATUS: {
            LOG_DEBUG(TRACE, "BLE GAP event: authentication status updated.");

            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            }
            else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_AUTH_PAYLOAD) {
                LOG_DEBUG(ERROR, "BLE GAP event: Authenticated payload timeout");
            }
        } break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response.");

            uint16_t serverMtu = event->evt.gattc_evt.params.exchange_mtu_rsp.server_rx_mtu;
            LOG_DEBUG(TRACE, "Effective Server RX MTU: %d.", serverMtu);

            uint16_t effectMtu = serverMtu > NRF_SDH_BLE_GATT_MAX_MTU_SIZE ? NRF_SDH_BLE_GATT_MAX_MTU_SIZE : serverMtu;
            msg.arg.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.arg.params.gatt_params_updated.version = 0x01;
            msg.arg.params.gatt_params_updated.conn_handle = event->evt.gattc_evt.conn_handle;
            msg.arg.params.gatt_params_updated.att_mtu_size = effectMtu;
            if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
            uint8_t svcCount = event->evt.gattc_evt.params.prim_srvc_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d primary service discovered.", svcCount);

            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_SERVICES) ) {
                for (uint8_t i = 0; i < svcCount; i++) {
                    s_bleInstance.discovery.services[s_bleInstance.discovery.count].start_handle = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.start_handle;
                    s_bleInstance.discovery.services[s_bleInstance.discovery.count].end_handle   = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.end_handle;
                    toHalUUID(&event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid, &s_bleInstance.discovery.services[s_bleInstance.discovery.count].uuid);
                    s_bleInstance.discovery.count++;
                    if (s_bleInstance.discovery.count >= BLE_MAX_SVC_COUNT) {
                        break;
                    }
                }
                uint16_t currEndHandle = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[svcCount-1].handle_range.end_handle;
                if ( (s_bleInstance.discovery.discAll)
                  && (s_bleInstance.discovery.count < BLE_MAX_SVC_COUNT)
                  && (currEndHandle < 0xFFFF) ) {
                    ret = sd_ble_gattc_primary_services_discover(event->evt.gattc_evt.conn_handle, currEndHandle + 1, NULL);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE service discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                msg.arg.type = BLE_EVT_SVC_DISCOVERED;
                msg.arg.params.svc_disc.version = 0x01;
                msg.arg.params.svc_disc.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.params.svc_disc.count = s_bleInstance.discovery.count;
                msg.arg.params.svc_disc.services = s_bleInstance.discovery.services;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    // This flag should be cleared after this event being popped, in case that
                    // further operation is needed to retrieve 128-bits UUID. If this event is
                    // not enqueued successfully, this flag should be clear here.
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                    os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                }
            }
        } break;

        case BLE_GATTC_EVT_CHAR_DISC_RSP: {
            uint8_t charCount = event->evt.gattc_evt.params.char_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d characteristic discovered.", charCount);

