particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) ) {
                for (uint8_t i = 0; i < charCount; i++) {
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].char_ext_props = event->evt.gattc_evt.params.char_disc_rsp.chars[i].char_ext_props;
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].properties     = toHalCharProps(event->evt.gattc_evt.params.char_disc_rsp.chars[i].char_props);
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].decl_handle    = event->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_decl;
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].value_handle   = event->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_value;
                    toHalUUID(&event->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid, &s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].uuid);

                    s_bleInstance.discovery.count++;
                    if (s_bleInstance.discovery.count >= BLE_MAX_CHAR_COUNT) {
                        break;
                    }
                }

                uint16_t currEndHandle = event->evt.gattc_evt.params.char_disc_rsp.chars[charCount-1].handle_value;
                if ( (currEndHandle < s_bleInstance.discovery.discEndHandle)
                  && (s_bleInstance.discovery.count < BLE_MAX_CHAR_COUNT) ) {
                    ble_gattc_handle_range_t handleRange;
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle   = s_bleInstance.discovery.discEndHandle;
                    ret = sd_ble_gattc_characteristics_discover(event->evt.gattc_evt.conn_handle, &handleRange);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                msg.arg.type = BLE_EVT_CHAR_DISCOVERED;
                msg.arg.params.char_disc.version = 0x01;
                msg.arg.params.char_disc.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.params.char_disc.count = s_bleInstance.discovery.count;
                msg.arg.params.char_disc.characteristics = s_bleInstance.discovery.characteristics;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    // This flag should be cleared after this event being popped, in case that
                    // further operation is needed to retrieve 128-bits UUID. If this event is
                    // not enqueued successfully, this flag should be clear here.
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                    os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                }
            }
        } break;

        case BLE_GATTC_EVT_DESC_DISC_RSP: {
            uint8_t descCount = event->evt.gattc_evt.params.desc_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d descriptors discovered.", descCount);

            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_DESCRIPTORS) ) {
                for (uint8_t i = 0; i < descCount; i++) {
                    // It will report all attributes with 16-bits UUID, filter descriptors.
                    switch (event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid) {
                        case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                        case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC:
                        case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                        case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT: {
                            s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].handle = event->evt.gattc_evt.params.desc_disc_rsp.descs[i].handle;
                            toHalUUID(&event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid, &s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].uuid);
                            s_bleInstance.discovery.count++;
                        }
                        default: break;
                    }
                    if (s_bleInstance.discovery.count >= BLE_MAX_DESC_COUNT) {
                        break;
                    }
                }

                uint16_t currEndHandle = event->evt.gattc_evt.params.desc_disc_rsp.descs[descCount-1].handle;
                if ( (currEndHandle < s_bleInstance.discovery.discEndHandle)
                  && (s_bleInstance.discovery.count < BLE_MAX_DESC_COUNT) ) {
                    ble_gattc_handle_range_t handleRange;
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle   = s_bleInstance.discovery.discEndHandle;
                    ret = sd_ble_gattc_descriptors_discover(event->evt.gattc_evt.conn_handle, &handleRange);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                msg.arg.type = BLE_EVT_DESC_DISCOVERED;
                msg.arg.params.desc_disc.version = 0x01;
                msg.arg.params.desc_disc.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.params.desc_disc.count = s_bleInstance.discovery.count;
                msg.arg.params.desc_disc.descriptors = s_bleInstance.discovery.descriptors;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    // This flag should be cleared after this event being popped, in case that
                    // further operation is needed to retrieve 128-bits UUID. If this event is
                    // not enqueued successfully, this flag should be clear here.
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                    os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                }
            }
        } break;

        case BLE_GATTC_EVT_READ_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");

