particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                if (s_bleInstance.discovering) {
                    if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_SERVICES)
                      && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].start_handle) ) {
                        s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        memcpy(s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.uuid128, event->evt.gattc_evt.params.read_rsp.data, BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.discovery.semaphore, false);
                    }
                    else if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS)
                           && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].decl_handle) ) {
                        s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        // The offset of Characteristic UUID in the Characteristic declaration attribute is 3.
                        memcpy(s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.uuid128, &event->evt.gattc_evt.params.read_rsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.discovery.semaphore, false);
                    }
                }
                else {
                    if (s_bleInstance.readAttrHandle == event->evt.gattc_evt.params.read_rsp.handle) {
                        s_bleInstance.readDataLen = event->evt.gattc_evt.params.read_rsp.len;
                        memcpy(s_bleInstance.readData, event->evt.gattc_evt.params.read_rsp.data, s_bleInstance.readDataLen);
                    }
                    os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
                }
            }
            else {
                LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }
        } break;

        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTC_EVT_HVX: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: data received. conn_handle: %d, attr_handle: %d, len: %d, type: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle,
                    event->evt.gattc_evt.params.hvx.len, event->evt.gattc_evt.params.hvx.type);

            if (event->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_INDICATION) {
                ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
                }
            }

            msg.arg.type = BLE_EVT_DATA_NOTIFIED;
            msg.arg.params.data_rec.version = 0x01;
            msg.arg.params.data_rec.conn_handle = event->evt.gattc_evt.conn_handle;
            msg.arg.params.data_rec.attr_handle = event->evt.gattc_evt.params.hvx.handle;
            msg.arg.params.data_rec.offset = 0;
            msg.arg.params.data_rec.data_len = event->evt.gattc_evt.params.hvx.len;
            memcpy(msg.arg.params.data_rec.data, event->evt.gattc_evt.params.hvx.data, msg.arg.params.data_rec.data_len);
            if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        default: {
            //LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

static os_thread_return_t handleBleEventThread(void* param) {
    while (1) {
        HalBleEvtMsg_t msg;
        if (!os_queue_take(s_bleInstance.evtQueue, &msg, CONCURRENT_WAIT_FOREVER, NULL)) {
            // Try retrieving 128-bits service or characteristic UUID before dispatching this event.
            if (   msg.arg.type == BLE_EVT_SVC_DISCOVERED
                || msg.arg.type == BLE_EVT_CHAR_DISCOVERED
                || msg.arg.type == BLE_EVT_DESC_DISCOVERED) {
                if (msg.arg.type == BLE_EVT_SVC_DISCOVERED) {
                    hal_ble_gattc_on_svc_disc_evt_t *svcDiscEvt = (hal_ble_gattc_on_svc_disc_evt_t*)&msg.arg.params;
                    for (uint8_t i = 0; i < svcDiscEvt->count; i++) {
                        if (svcDiscEvt->services[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            if (!os_semaphore_create(&s_bleInstance.discovery.semaphore, 1, 0)) {
                                ret_code_t ret = sd_ble_gattc_read(svcDiscEvt->conn_handle, svcDiscEvt->services[i].start_handle, 0);
                                if (ret == NRF_SUCCESS) {
                                    s_bleInstance.discovery.currIndex = i;
                                    if (!os_semaphore_take(s_bleInstance.discovery.semaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false)) {
                                        os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                        continue;
                                    }
                                }
                                else {
                                    LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                }
                                os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                break;
                            }
                            else {
                                LOG(ERROR, "os_semaphore_create() failed");
                                break;
                            }
                        }
                    }
                }
                else if (msg.arg.type == BLE_EVT_CHAR_DISCOVERED) {
                    hal_ble_gattc_on_char_disc_evt_t* charDiscEvt = (hal_ble_gattc_on_char_disc_evt_t*)&msg.arg.params;
                    for (uint8_t i = 0; i < charDiscEvt->count; i++) {
                        if (charDiscEvt->characteristics[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            if (!os_semaphore_create(&s_bleInstance.discovery.semaphore, 1, 0)) {
                                ret_code_t ret = sd_ble_gattc_read(charDiscEvt->conn_handle, charDiscEvt->characteristics[i].decl_handle, 0);
                                if (ret == NRF_SUCCESS) {
                                    s_bleInstance.discovery.currIndex = i;
                                    if (!os_semaphore_take(s_bleInstance.discovery.semaphore, 2000, false)) {
                                        os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                        continue;
                                    }
                                }
                                else {
                                    LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                }
                                os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                break;
                            }
                            else {
                                LOG(ERROR, "os_semaphore_create() failed");
                                break;
                            }
                        }
                    }
                }
            }

