particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            for (uint8_t i = 0; i < BLE_MAX_EVT_CB_COUNT; i++) {
                if (s_bleInstance.evtCbs[i].handler != NULL) {
                    s_bleInstance.evtCbs[i].handler(&msg.arg, s_bleInstance.evtCbs[i].context);
                }
            }

            if (   msg.arg.type == BLE_EVT_SVC_DISCOVERED
                || msg.arg.type == BLE_EVT_CHAR_DISCOVERED
                || msg.arg.type == BLE_EVT_DESC_DISCOVERED) {
                s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                s_bleInstance.discovering = false;
                os_semaphore_give(s_bleInstance.discoverySemaphore, false);
            }
        }
        else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }

    os_thread_exit(s_bleInstance.evtThread);
}


/* FIXME: It causes a section type conflict if using NRF_SDH_BLE_OBSERVER() in c++ class.*/
class Broadcaster;
typedef struct {
    Broadcaster* instance;
} BroadcasterImpl;
static BroadcasterImpl broadcasterImpl;

class Broadcaster {
public:
    // Singleton
    static Broadcaster& getInstance(void) {
        static Broadcaster instance;
        return instance;
    }

    bool advertising(void) const {
        return isAdvertising_;
    }

    int setAdvertisingParams(const hal_ble_adv_params_t* params) {
        if (params == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        int ret = suspend();
        CHECK_RETURN(ret, nullptr);
        ret = configure(params);
        NRF_CHECK_RETURN(ret, nullptr);
        memcpy(&advParams_, params, sizeof(hal_ble_adv_params_t));
        return resume();
    }

    int getAdvertisingParams(hal_ble_adv_params_t* params) const {
        if (params == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        memcpy(params, &advParams_, sizeof(hal_ble_adv_params_t));
        return SYSTEM_ERROR_NONE;
    }

    int setAdvertisingData(const uint8_t* buf, size_t len) {
        // It is invalid to provide the same data buffers while advertising.
        int ret = suspend();
        CHECK_RETURN(ret, nullptr);
        if (buf != nullptr) {
            len = len > BLE_MAX_ADV_DATA_LEN ? BLE_MAX_ADV_DATA_LEN : len;
            memcpy(advData_, buf, len);
        }
        else {
            // It should at least contain the Flags in advertising data.
            len = 3;
        }
        advDataLen_ = len;
        ret = configure(nullptr);
        CHECK_RETURN(ret, nullptr);
        return resume();
    }

    size_t getAdvertisingData(uint8_t* buf, size_t len) const {
        if (buf == nullptr) {
            return 0;
        }
        len = len > advDataLen_ ? advDataLen_ : len;
        memcpy(buf, advData_, len);
        return len;
    }

    int setScanResponseData(const uint8_t* buf, size_t len) {
        // It is invalid to provide the same data buffers while advertising.
        int ret = suspend();
        CHECK_RETURN(ret, nullptr);
        if (buf != nullptr) {
            len = len > BLE_MAX_ADV_DATA_LEN ? BLE_MAX_ADV_DATA_LEN : len;
            memcpy(scanRespData_, buf, len);
        }
        else {
            len = 0;
        }
        scanRespDataLen_ = len;
        ret = configure(nullptr);
        CHECK_RETURN(ret, nullptr);
        return resume();
    }

    size_t getScanResponseData(uint8_t* buf, size_t len) const {
        if (buf == nullptr) {
            return 0;
        }
        len = len > scanRespDataLen_ ? scanRespDataLen_ : len;
        memcpy(buf, scanRespData_, len);
        return len;
    }

    int setTxPower(int8_t val) {
        int ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, advHandle_, roundTxPower(val));
        NRF_CHECK_RETURN(ret, "sd_ble_gap_tx_power_set");
        return SYSTEM_ERROR_NONE;
    }

    int8_t getTxPower(void) const {
        return txPower_;
    }

    int startAdvertising(void) {
        int ret;
        if (isAdvertising_) {
            // Stop advertising first.
            ret = sd_ble_gap_adv_stop(advHandle_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_stop");
            isAdvertising_ = false;
        }
        ret = sd_ble_gap_adv_start(advHandle_, BLE_CONN_CFG_TAG);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_start");
        isAdvertising_ = true;
        return SYSTEM_ERROR_NONE;
    }

    int stopAdvertising(void) {
        if (isAdvertising_) {
            int ret = sd_ble_gap_adv_stop(advHandle_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_stop");
            isAdvertising_ = false;
        }
        return SYSTEM_ERROR_NONE;
    }

private:
    uint8_t isAdvertising_ : 1;                     /**< If it is advertising or not. */
    uint8_t advHandle_;                             /**< Advertising handle. */
    hal_ble_adv_params_t advParams_;                /**< Current advertising parameters. */
    uint8_t advData_[BLE_MAX_ADV_DATA_LEN];         /**< Current advertising data. */
    size_t  advDataLen_;                            /**< Current advertising data length. */
    uint8_t scanRespData_[BLE_MAX_ADV_DATA_LEN];    /**< Current scan response data. */
    size_t  scanRespDataLen_;                       /**< Current scan response data length. */
    int8_t  txPower_;                               /**< TX Power. */
    bool advPending_;                               /**< Advertising is pending. */
    uint16_t connHandle_;                           /**< Connection handle. It is assigned once device is connected
                                                         as Peripheral. It is used for re-start advertising. */
    static const int8_t validTxPower_[8];

    Broadcaster() {
        isAdvertising_ = false;
        advPending_ = false;
        advHandle_ = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
        /* Default advertising parameters. */
        advParams_.version = 0x01;
        advParams_.type = BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT;
        advParams_.filter_policy = BLE_ADV_FP_ANY;
        advParams_.interval = BLE_DEFAULT_ADVERTISING_INTERVAL;
        advParams_.timeout = BLE_DEFAULT_ADVERTISING_TIMEOUT;
        advParams_.inc_tx_power = false;
        memset(advData_, 0x00, sizeof(advData_));
        memset(scanRespData_, 0x00, sizeof(scanRespData_));
        advDataLen_ = scanRespDataLen_ = 0;
        /* Default advertising data. */
        // FLags
        advData_[advDataLen_++] = 0x02;
        advData_[advDataLen_++] = BLE_SIG_AD_TYPE_FLAGS;
        advData_[advDataLen_++] = BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
        int ret = configure(&advParams_);
        CHECK_RETURN_VOID(ret, nullptr);
        /* Default TX power. */
        txPower_ = 0;
        setTxPower(txPower_);
        broadcasterImpl.instance = this;
        NRF_SDH_BLE_OBSERVER(bleBroadcaster, 1, processBroadcasterEvents, &broadcasterImpl);
    }

