particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    ~Broadcaster() = default;

    int suspend(void) {
        if (isAdvertising_) {
            int ret = ble_gap_stop_advertising();
            CHECK_RETURN(ret, "ble_gap_stop_advertising");
            advPending_ = true;
        }
        return SYSTEM_ERROR_NONE;
    }

    int resume(void) {
        if (advPending_) {
            int ret = startAdvertising();
            CHECK_RETURN(ret, nullptr);
            advPending_ = false;
        }
        return SYSTEM_ERROR_NONE;
    }

    void toPlatformAdvParams(ble_gap_adv_params_t* params, const hal_ble_adv_params_t* halParams) const {
        memset(params, 0x00, sizeof(ble_gap_adv_params_t));
        params->properties.type = halParams->type;
        params->properties.include_tx_power = false; // FIXME: for extended advertising packet
        params->p_peer_addr = NULL;
        params->interval = halParams->interval;
        params->duration = halParams->timeout;
        params->filter_policy = halParams->filter_policy;
        params->primary_phy = BLE_GAP_PHY_1MBPS;
    }

    void toPlatformAdvData(ble_gap_adv_data_t* data) {
        data->adv_data.p_data = advData_;
        data->adv_data.len = advDataLen_;
        data->scan_rsp_data.p_data = scanRespData_;
        data->scan_rsp_data.len = scanRespDataLen_;
    }

    int configure(const hal_ble_adv_params_t* params) {
        int ret;
        ble_gap_adv_data_t bleGapAdvData;
        toPlatformAdvData(&bleGapAdvData);
        if (params == nullptr) {
            ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, NULL);
        }
        else {
            ble_gap_adv_params_t bleGapAdvParams;
            toPlatformAdvParams(&bleGapAdvParams, params);
            LOG_DEBUG(TRACE, "BLE advertising interval: %.3fms, timeout: %dms.",
                      bleGapAdvParams.interval*0.625, bleGapAdvParams.duration*10);
            ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, &bleGapAdvParams);
        }
        NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_set_configure");
        return SYSTEM_ERROR_NONE;
    }

    int8_t roundTxPower(int8_t value) {
        uint8_t i = 0;
        for (i = 0; i < sizeof(validTxPower_); i++) {
            if (value == validTxPower_[i]) {
                return value;
            }
            else {
                if (value < validTxPower_[i]) {
                    return validTxPower_[i];
                }
            }
        }
        return validTxPower_[i - 1];
    }

    static void processBroadcasterEvents(const ble_evt_t* event, void* context) {
        Broadcaster* broadcaster = static_cast<BroadcasterImpl*>(context)->instance;
        switch (event->header.evt_id) {
            case BLE_GAP_EVT_ADV_SET_TERMINATED: {
                LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
                broadcaster->isAdvertising_ = false;
                HalBleEvtMsg_t msg;
                memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));
                msg.arg.type = BLE_EVT_ADV_STOPPED;
                msg.arg.params.adv_stopped.version = 0x01;
                msg.arg.params.adv_stopped.reserved = NULL;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            } break;

            case BLE_GAP_EVT_CONNECTED: {
                // FIXME: If multi role is enabled, this flag should not be clear here.
                broadcaster->isAdvertising_ = false;
                if (event->evt.gap_evt.params.connected.role == BLE_ROLE_PERIPHERAL) {
                    broadcaster->connHandle_ = event->evt.gap_evt.conn_handle;
                }
            } break;

            case BLE_GAP_EVT_DISCONNECTED: {
                // Re-start advertising.
                // FIXME: when multi-role implemented.
                if (broadcaster->connHandle_ == event->evt.gap_evt.conn_handle) {
                    LOG_DEBUG(TRACE, "Restart BLE advertising.");
                    int ret = broadcaster->startAdvertising();
                    CHECK_RETURN_VOID(ret, nullptr);
                    broadcaster->isAdvertising_ = true;
                    broadcaster->connHandle_ = BLE_INVALID_CONN_HANDLE;
                }
            } break;

            default: break;
        }
    }
};

const int8_t Broadcaster::validTxPower_[8] = { -20, -16, -12, -8, -4, 0, 4, 8 };


class Observer;
typedef struct {
    Observer* instance;
} ObserverImpl;
static ObserverImpl observerImpl;

class Observer {
public:
    // Singleton
    static Observer& getInstance(void) {
        static Observer instance;
        return instance;
    }

    bool scanning(void) {
        return isScanning_;
    }

    int setScanParams(const hal_ble_scan_params_t* params) {
        if (params == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if ((params->interval < BLE_GAP_SCAN_INTERVAL_MIN) ||
                (params->interval > BLE_GAP_SCAN_INTERVAL_MAX) ||
                (params->window < BLE_GAP_SCAN_WINDOW_MIN) ||
                (params->window > BLE_GAP_SCAN_WINDOW_MAX) ||
                (params->window > params->interval) ) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        memcpy(&scanParams_, params, sizeof(hal_ble_scan_params_t));
        return SYSTEM_ERROR_NONE;
    }

    int getScanParams(hal_ble_scan_params_t* params) const {
        if (params == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        memcpy(params, &scanParams_, sizeof(hal_ble_scan_params_t));
        return SYSTEM_ERROR_NONE;
    }

    int startScanning(bool restart) {
        if(restart) {
            int ret = sd_ble_gap_scan_start(NULL, &bleScanData_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
            return SYSTEM_ERROR_NONE;
        }
        if (isScanning_) {
            return SYSTEM_ERROR_INVALID_STATE;
        }
        if (os_semaphore_create(&scanSemaphore_, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }
        ble_gap_scan_params_t bleGapScanParams;
        toPlatformScanParams(&bleGapScanParams);
        LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
        LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
                bleGapScanParams.interval*0.625, bleGapScanParams.window*0.625, bleGapScanParams.timeout*10);
        cache_.clear();
        int ret = sd_ble_gap_scan_start(&bleGapScanParams, &bleScanData_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
        isScanning_ = true;
        os_semaphore_take(scanSemaphore_, CONCURRENT_WAIT_FOREVER, false);
        os_semaphore_destroy(scanSemaphore_);
        return SYSTEM_ERROR_NONE;
    }

    int stopScanning(void) {
        if (!isScanning_) {
            return SYSTEM_ERROR_NONE;
        }
        int ret = sd_ble_gap_scan_stop();
        NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_stop");
        os_semaphore_give(scanSemaphore_, false);
        isScanning_ = false;
        return SYSTEM_ERROR_NONE;
    }

