particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    void toPlatformScanParams(ble_gap_scan_params_t* params) const {
        memset(params, 0x00, sizeof(ble_gap_scan_params_t));
        params->extended = 0;
        params->active = scanParams_.active;
        params->interval = scanParams_.interval;
        params->window = scanParams_.window;
        params->timeout = scanParams_.timeout;
        params->scan_phys = BLE_GAP_PHY_1MBPS;
        params->filter_policy = scanParams_.filter_policy;
    }

private:
    uint8_t isScanning_: 1;                                 /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_SCAN_REPORT_BUF_LEN];   /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    Vector<hal_ble_addr_t> cache_;                          /**< Cached address of scanned devices to filter-out duplicated result. */

    Observer() {
        isScanning_ = false;
        scanParams_.version = 0x01;
        scanParams_.active = true;
        scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
        scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
        scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
        scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;
        scanSemaphore_ = nullptr;
        bleScanData_.p_data = scanReportBuff_;
        bleScanData_.len = sizeof(scanReportBuff_);
        observerImpl.instance = this;
        NRF_SDH_BLE_OBSERVER(bleObserver, 1, processObserverEvents, &observerImpl);
    }

    ~Observer() = default;

    bool chacheDevice(const hal_ble_addr_t& newAddr) {
        for (int i = 0; i < cache_.size(); i++) {
            const hal_ble_addr_t& existAddr = cache_[i];
            if (existAddr.addr_type == newAddr.addr_type &&
                    !memcmp(existAddr.addr, newAddr.addr, BLE_SIG_ADDR_LEN)) {
                LOG_DEBUG(TRACE, "Duplicated scan result. Filter it out.");
                return false;
            }
        }
        cache_.append(newAddr);
        return true;
    }

    static void processObserverEvents(const ble_evt_t* event, void* context) {
        Observer* observer = static_cast<ObserverImpl*>(context)->instance;
        HalBleEvtMsg_t msg;
        memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));
        switch (event->header.evt_id) {
            case BLE_GAP_EVT_ADV_REPORT: {
                LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");
                hal_ble_addr_t newAddr;
                newAddr.addr_type = event->evt.gap_evt.params.adv_report.peer_addr.addr_type;
                memcpy(newAddr.addr, event->evt.gap_evt.params.adv_report.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (observer->chacheDevice(newAddr)) {
                    // The new scanned device is not in the cached device list.
                    msg.arg.type = BLE_EVT_SCAN_RESULT;
                    msg.arg.params.scan_result.version = 0x01;
                    msg.arg.params.scan_result.type.connectable = event->evt.gap_evt.params.adv_report.type.connectable;
                    msg.arg.params.scan_result.type.scannable = event->evt.gap_evt.params.adv_report.type.scannable;
                    msg.arg.params.scan_result.type.directed = event->evt.gap_evt.params.adv_report.type.directed;
                    msg.arg.params.scan_result.type.scan_response = event->evt.gap_evt.params.adv_report.type.scan_response;
                    msg.arg.params.scan_result.type.extended_pdu = event->evt.gap_evt.params.adv_report.type.extended_pdu;
                    msg.arg.params.scan_result.rssi = event->evt.gap_evt.params.adv_report.rssi;
                    msg.arg.params.scan_result.data_len = event->evt.gap_evt.params.adv_report.data.len;
                    memcpy(msg.arg.params.scan_result.data, event->evt.gap_evt.params.adv_report.data.p_data, msg.arg.params.scan_result.data_len);
                    msg.arg.params.scan_result.peer_addr.addr_type = newAddr.addr_type;
                    memcpy(msg.arg.params.scan_result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                    if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }
                // Continue scanning, scanning parameters pointer must be set to NULL.
                observer->startScanning(true);
            } break;

            case BLE_GAP_EVT_TIMEOUT: {
                if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                    LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                    observer->isScanning_ = false;
                    msg.arg.type = BLE_EVT_SCAN_STOPPED;
                    msg.arg.params.scan_stopped.version = 0x01;
                    msg.arg.params.scan_stopped.reserved = NULL;
                    if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                    os_semaphore_give(observer->scanSemaphore_, false);
                }
            } break;

            default: break;
        }
    }
};


class ConnectionsManager;
typedef struct {
    ConnectionsManager* instance;
} ConnectionsManagerImpl;
static ConnectionsManagerImpl connMgrImpl;

class ConnectionsManager {
public:
    // Singleton
    static ConnectionsManager& getInstance(void) {
        static ConnectionsManager instance;
        return instance;
    }

    int setPPCP(const hal_ble_conn_params_t* ppcp) {
        if (ppcp == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if ((ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE) &&
                (ppcp->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN ||
                 ppcp->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if ((ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE) &&
                (ppcp->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN ||
                 ppcp->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (ppcp->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if ((ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE) &&
                (ppcp->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN ||
                 ppcp->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        ble_gap_conn_params_t bleGapConnParams;
        toPlatformConnParams(&bleGapConnParams, ppcp);
        int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_set");
        return SYSTEM_ERROR_NONE;
    }

