particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    int getPPCP(hal_ble_conn_params_t* ppcp) const {
        if (ppcp == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        ble_gap_conn_params_t bleGapConnParams;
        int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
        toHalConnParams(ppcp, &bleGapConnParams);
        return SYSTEM_ERROR_NONE;
    }

    bool connecting(void) const {
        return isConnecting_;
    }

    bool connected(const hal_ble_addr_t* address=nullptr) {
        if (address == nullptr) {
            return connections_.size() > 0;
        }
        else if (fetchConnection(address)) {
            return true;
        }
        return false;
    }

    int connect(const hal_ble_addr_t* address) {
        // Stop scanning first to give the scanning semaphore if possible.
        int ret = Observer::getInstance().stopScanning();
        CHECK_RETURN(ret, nullptr);
        if (os_semaphore_create(&connectSemaphore_, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }
        ble_gap_addr_t bleDevAddr;
        ble_gap_scan_params_t bleGapScanParams;
        ble_gap_conn_params_t bleGapConnParams;
        memset(&bleDevAddr, 0x00, sizeof(ble_gap_addr_t));
        bleDevAddr.addr_type = address->addr_type;
        memcpy(bleDevAddr.addr, address->addr, BLE_SIG_ADDR_LEN);
        Observer::getInstance().toPlatformScanParams(&bleGapScanParams);
        ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
        ret = sd_ble_gap_connect(&bleDevAddr, &bleGapScanParams, &bleGapConnParams, BLE_CONN_CFG_TAG);
        if (ret != NRF_SUCCESS) {
            os_semaphore_destroy(connectSemaphore_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_connect");
        }
        isConnecting_ = true;
        memcpy(&connectingAddr_, address, sizeof(hal_ble_addr_t));
        ret = SYSTEM_ERROR_NONE;
        if (os_semaphore_take(connectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
            ret = SYSTEM_ERROR_TIMEOUT;
        }
        os_semaphore_destroy(connectSemaphore_);
        isConnecting_ = false;
        memset(&connectingAddr_, 0x00, sizeof(hal_ble_addr_t));
        return ret;
    }

    int connectCancel(void) {
        if (isConnecting_) {
            int ret = sd_ble_gap_connect_cancel();
            NRF_CHECK_RETURN(ret, "sd_ble_gap_connect_cancel");
            isConnecting_ = false;
        }
        return SYSTEM_ERROR_NONE;
    }

    int disconnect(uint16_t connHandle) {
        if (fetchConnection(connHandle) == nullptr) {
            return SYSTEM_ERROR_NOT_FOUND;
        }
        if (os_semaphore_create(&disconnectSemaphore_, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }
        int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_SUCCESS) {
            os_semaphore_destroy(disconnectSemaphore_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_disconnect");
        }
        disconnectingHandle_ = connHandle;
        ret = SYSTEM_ERROR_NONE;
        if (os_semaphore_take(disconnectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
            ret = SYSTEM_ERROR_TIMEOUT;
        }
        os_semaphore_destroy(disconnectSemaphore_);
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
        return ret;
    }

    int updateConnectionParams(uint16_t connHandle, const hal_ble_conn_params_t* params) {
        int ret;
        if (fetchConnection(connHandle) == nullptr) {
            return SYSTEM_ERROR_NOT_FOUND;
        }
        if (os_semaphore_create(&connParamsUpdateSemaphore_, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }
        ble_gap_conn_params_t bleGapConnParams;
        if (params == NULL) {
            // Use the PPCP characteristic value as the connection parameters.
            ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
        }
        // For Central role, this will initiate the connection parameter update procedure.
        // For Peripheral role, this will use the passed in parameters and send the request to central.
        ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
        if (ret != NRF_SUCCESS) {
            os_semaphore_destroy(connParamsUpdateSemaphore_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_conn_param_update");
        }
        connParamUpdateHandle_ = connHandle;
        ret = SYSTEM_ERROR_NONE;
        if (os_semaphore_take(connParamsUpdateSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
            ret = SYSTEM_ERROR_TIMEOUT;
        }
        os_semaphore_destroy(connParamsUpdateSemaphore_);
        connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        return ret;
    }

    int getConnectionParams(uint16_t connHandle, hal_ble_conn_params_t* params) {
        BleConnection_t* connection = fetchConnection(connHandle);
        if (connection == nullptr) {
            return SYSTEM_ERROR_NOT_FOUND;
        }
        memcpy(params, &connection->effectiveConnParams, sizeof(hal_ble_conn_params_t));
        return SYSTEM_ERROR_NONE;
    }

private:
    typedef struct {
        uint8_t role;
        uint16_t connHandle;
        hal_ble_conn_params_t effectiveConnParams;
        hal_ble_addr_t peer;
    } BleConnection_t;

    uint8_t isConnecting_ : 1;                      /**< If it is connecting or not. */
    hal_ble_addr_t connectingAddr_;                 /**< Address of peer the Central is connecting to. */
    uint16_t disconnectingHandle_;                  /**< Handle of connection to be disconnected. */
    uint16_t connParamUpdateHandle_;                /**< Handle of the connection that is to send peripheral connection update request. */
    uint8_t connParamsUpdateAttempts_;              /**< Attempts for peripheral to update connection parameters. */
    os_timer_t connParamsUpdateTimer_;              /**< Timer used for sending peripheral connection update request after connection established. */
    os_semaphore_t connParamsUpdateSemaphore_;      /**< Semaphore to wait until connection parameters updated. */
    os_semaphore_t connectSemaphore_;               /**< Semaphore to wait until connection established. */
    os_semaphore_t disconnectSemaphore_;            /**< Semaphore to wait until connection disconnected. */
    Vector<BleConnection_t> connections_;           /**< Current on-going connections. */

    static const uint32_t CONNECTION_OPERATION_TIMEOUT_MS = 5000;

    ConnectionsManager() {
        isConnecting_ = 0;
        memset(&connectingAddr_, 0x00, sizeof(hal_ble_addr_t));
        connParamsUpdateAttempts_ = 0;
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
        connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        /*
         * Default Peripheral Preferred Connection Parameters.
         * For BLE Central, this is the initial connection parameters.
         * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
         */
        ble_gap_conn_params_t bleGapConnParams;
        bleGapConnParams.min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL;
        bleGapConnParams.max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL;
        bleGapConnParams.slave_latency = BLE_DEFAULT_SLAVE_LATENCY;
        bleGapConnParams.conn_sup_timeout = BLE_DEFAULT_CONN_SUP_TIMEOUT;
        int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
        NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_ppcp_set");
        connectSemaphore_ = nullptr;
        disconnectSemaphore_ = nullptr;
        connParamsUpdateSemaphore_ = nullptr;
        connParamsUpdateTimer_ = nullptr;
        if (os_timer_create(&connParamsUpdateTimer_, BLE_CONN_PARAMS_UPDATE_DELAY_MS, onConnParamsUpdateTimerExpired, this, true, nullptr)) {
            LOG(ERROR, "os_timer_create() failed.");
        }
        connMgrImpl.instance = this;
        NRF_SDH_BLE_OBSERVER(bleConnectionManager, 1, processConnectionEvents, &connMgrImpl);
    }

    ~ConnectionsManager() = default;

