particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    void toPlatformConnParams(ble_gap_conn_params_t* params, const hal_ble_conn_params_t* halConnParams) const {
        memset(params, 0x00, sizeof(ble_gap_conn_params_t));
        params->min_conn_interval = halConnParams->min_conn_interval;
        params->max_conn_interval = halConnParams->max_conn_interval;
        params->slave_latency = halConnParams->slave_latency;
        params->conn_sup_timeout = halConnParams->conn_sup_timeout;
    }

    void toHalConnParams(hal_ble_conn_params_t* halConnParams, const ble_gap_conn_params_t* params) const {
        memset(halConnParams, 0x00, sizeof(hal_ble_conn_params_t));
        halConnParams->min_conn_interval = params->min_conn_interval;
        halConnParams->max_conn_interval = params->max_conn_interval;
        halConnParams->slave_latency = params->slave_latency;
        halConnParams->conn_sup_timeout = params->conn_sup_timeout;
    }

    BleConnection_t* fetchConnection(uint16_t connHandle) {
        if (connHandle == BLE_INVALID_CONN_HANDLE) {
            return nullptr;
        }
        for (int i = 0; i < connections_.size(); i++) {
            BleConnection_t& connection = connections_.at(i);
            if (connection.connHandle == connHandle) {
                return &connection;
            }
        }
        return nullptr;
    }

    BleConnection_t* fetchConnection(const hal_ble_addr_t* address) {
        if (address == nullptr) {
            return nullptr;
        }
        for (int i = 0; i < connections_.size(); i++) {
            BleConnection_t& connection = connections_.at(i);
            hal_ble_addr_t& peer = connection.peer;
            if (peer.addr_type == address->addr_type &&
                    !memcmp(peer.addr, address->addr, BLE_SIG_ADDR_LEN)) {
                return &connection;
            }
        }
        return nullptr;
    }

    void addConnection(const BleConnection_t& connection) {
        removeConnection(connection.connHandle);
        connections_.append(connection);
    }

    void removeConnection(uint16_t connHandle) {
        for (int i = 0; i < connections_.size(); i++) {
            const BleConnection_t& connection = connections_[i];
            if (connection.connHandle == connHandle) {
                connections_.removeAt(i);
            }
        }
    }

    void initiateConnParamsUpdateIfNeeded(const BleConnection_t* connection) {
        if (connParamsUpdateTimer_ == nullptr) {
            return;
        }
        if (!isConnParamsFeeded(&connection->effectiveConnParams)) {
            if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
                if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, true, 0, 0, NULL)) {
                    LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                            connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
                    connParamUpdateHandle_ = connection->connHandle;
                    return;
                }
            }
            else {
                int ret = sd_ble_gap_disconnect(connection->connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_disconnect");
                LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
            }
        }
    }

    bool isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
        hal_ble_conn_params_t ppcp;
        if (getPPCP(&ppcp) == SYSTEM_ERROR_NONE) {
            uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
            uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
            uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
            uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
            if (params->max_conn_interval < ppcp.min_conn_interval ||
                    params->max_conn_interval > ppcp.max_conn_interval) {
                return false;
            }
            if (params->slave_latency < minAcceptedSl ||
                    params->slave_latency > maxAcceptedSl) {
                return false;
            }
            if (params->conn_sup_timeout < minAcceptedTo ||
                    params->conn_sup_timeout > maxAcceptedTo) {
                return false;
            }
        }
        return true;
    }

    static void onConnParamsUpdateTimerExpired(os_timer_t timer) {
        ConnectionsManager* connMgr;
        os_timer_get_id(timer, (void**)&connMgr);
        if (connMgr->connParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
            return;
        }
        // For Peripheral, it will use the PPCP characteristic value.
        int ret = sd_ble_gap_conn_param_update(connMgr->connParamUpdateHandle_, nullptr);
        if (ret != NRF_SUCCESS) {
            sd_ble_gap_disconnect(connMgr->connParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
            NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_conn_param_update");
        }
        connMgr->connParamsUpdateAttempts_++;
    }

    static void processConnectionEvents(const ble_evt_t* event, void* context) {
        ConnectionsManager* connMgr = static_cast<ConnectionsManagerImpl*>(context)->instance;
        HalBleEvtMsg_t msg;
        memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));
        switch (event->header.evt_id) {
            case BLE_GAP_EVT_CONNECTED: {
                LOG_DEBUG(TRACE, "BLE GAP event: connected.");

                BleConnection_t newConnection;
                newConnection.role = event->evt.gap_evt.params.connected.role;
                newConnection.connHandle = event->evt.gap_evt.conn_handle;
                connMgr->toHalConnParams(&newConnection.effectiveConnParams, &event->evt.gap_evt.params.connected.conn_params);
                newConnection.peer.addr_type = event->evt.gap_evt.params.connected.peer_addr.addr_type;
                memcpy(newConnection.peer.addr, event->evt.gap_evt.params.connected.peer_addr.addr, BLE_SIG_ADDR_LEN);
                connMgr->addConnection(newConnection);

