particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
                LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", newConnection.role, newConnection.connHandle);
                LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
                LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                        newConnection.effectiveConnParams.max_conn_interval*1.25,
                        newConnection.effectiveConnParams.slave_latency,
                        newConnection.effectiveConnParams.conn_sup_timeout*10);
                // If the connection is initiated by Central.
                if (connMgr->isConnecting_ && newConnection.peer.addr_type == connMgr->connectingAddr_.addr_type &&
                        !memcmp(newConnection.peer.addr, connMgr->connectingAddr_.addr, BLE_SIG_ADDR_LEN)) {
                    os_semaphore_give(connMgr->connectSemaphore_, false);
                }
                // Update connection parameters if needed.
                if (newConnection.role == BLE_ROLE_PERIPHERAL) {
                    connMgr->connParamsUpdateAttempts_ = 0;
                    connMgr->initiateConnParamsUpdateIfNeeded(&newConnection);
                }
                msg.arg.type = BLE_EVT_CONNECTED;
                msg.arg.params.connected.version = 0x01;
                msg.arg.params.connected.role = newConnection.role;
                msg.arg.params.connected.conn_handle = newConnection.connHandle;
                msg.arg.params.connected.conn_interval = newConnection.effectiveConnParams.max_conn_interval;
                msg.arg.params.connected.slave_latency = newConnection.effectiveConnParams.slave_latency;
                msg.arg.params.connected.conn_sup_timeout = newConnection.effectiveConnParams.conn_sup_timeout;
                msg.arg.params.connected.peer_addr.addr_type = newConnection.peer.addr_type;
                memcpy(msg.arg.params.connected.peer_addr.addr, newConnection.peer.addr, BLE_SIG_ADDR_LEN);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            } break;

            case BLE_GAP_EVT_DISCONNECTED: {
                LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d",
                          event->evt.gap_evt.conn_handle, event->evt.gap_evt.params.disconnected.reason);
                BleConnection_t* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
                if (connection != nullptr) {
                    // Cancel the on-going connection parameters update procedure.
                    if (connMgr->connParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                        if (connection->role == BLE_ROLE_PERIPHERAL) {
                            connMgr->connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                            if (!os_timer_is_active(connMgr->connParamsUpdateTimer_, NULL)) {
                                os_timer_change(connMgr->connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, NULL);
                            }
                        }
                        else {
                            os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                        }
                    }
                    if (connMgr->disconnectingHandle_ == event->evt.gap_evt.conn_handle) {
                        os_semaphore_give(connMgr->disconnectSemaphore_, false);
                    }
                    connMgr->removeConnection(event->evt.gap_evt.conn_handle);
                }
                else {
                    LOG(ERROR, "Connection not found.");
                    return;
                }
                msg.arg.type = BLE_EVT_DISCONNECTED;
                msg.arg.params.disconnected.version = 0x01;
                msg.arg.params.disconnected.reason = event->evt.gap_evt.params.disconnected.reason;
                msg.arg.params.disconnected.conn_handle = event->evt.gap_evt.conn_handle;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            } break;

            case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
                LOG_DEBUG(TRACE, "BLE GAP event: connection parameter update request.");
                int ret = sd_ble_gap_conn_param_update(event->evt.gap_evt.conn_handle,
                        &event->evt.gap_evt.params.conn_param_update_request.conn_params);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
                }
            } break;

            case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
                LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");
                BleConnection_t* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
                if (connection != nullptr) {
                    connMgr->toHalConnParams(&connection->effectiveConnParams, &event->evt.gap_evt.params.conn_param_update.conn_params);
                    if (connection->role == BLE_ROLE_PERIPHERAL) {
                        connMgr->initiateConnParamsUpdateIfNeeded(connection);
                    }
                    else {
                        os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                    }
                }
                else {
                    LOG(ERROR, "Connection not found.");
                    return;
                }
                LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
                LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                        connection->effectiveConnParams.max_conn_interval*1.25,
                        connection->effectiveConnParams.slave_latency,
                        connection->effectiveConnParams.conn_sup_timeout*10);
                msg.arg.type = BLE_EVT_CONN_PARAMS_UPDATED;
                msg.arg.params.conn_params_updated.version = 0x01;
                msg.arg.params.conn_params_updated.conn_handle = event->evt.gap_evt.conn_handle;
                msg.arg.params.conn_params_updated.conn_interval = event->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
                msg.arg.params.conn_params_updated.slave_latency = event->evt.gap_evt.params.conn_param_update.conn_params.slave_latency;
                msg.arg.params.conn_params_updated.conn_sup_timeout = event->evt.gap_evt.params.conn_param_update.conn_params.conn_sup_timeout;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            } break;

            case BLE_GAP_EVT_TIMEOUT: {
                if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                    LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
                    if (connMgr->isConnecting_) {
                        os_semaphore_give(connMgr->connectSemaphore_, false);
                    }
                }
            } break;

