particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            default: break;
        }
    }
};


class GattServer;
typedef struct {
    GattServer* instance;
} GattServerImpl;
static GattServerImpl gattsImpl;

class GattServer {
public:
    // Singleton
    static GattServer& getInstance(void) {
        static GattServer instance;
        return instance;
    }

    int addService(uint8_t type, const hal_ble_uuid_t* uuid, uint16_t* handle) {
        ble_uuid_t svcUuid;
        if (uuid == nullptr || handle == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        int ret = toPlatformUUID(uuid, &svcUuid);
        CHECK_RETURN(ret, nullptr);
        ret = sd_ble_gatts_service_add(type, &svcUuid, handle);
        NRF_CHECK_RETURN(ret, "sd_ble_gatts_service_add");
        services_.append(*handle);
        LOG_DEBUG(TRACE, "Service handle: %d.", *handle);
        return SYSTEM_ERROR_NONE;
    }

    int addCharacteristic(uint16_t svcHandle, uint8_t properties, const hal_ble_uuid_t* uuid, const char* desc, hal_ble_char_handles_t* handles) {
        if (handles == nullptr || uuid == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (characteristics_.size() >= BLE_MAX_CHAR_COUNT) {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
        if (findService(svcHandle)) {
            ble_uuid_t charUuid;
            ble_gatts_char_md_t charMd;
            ble_gatts_attr_md_t valueAttrMd;
            ble_gatts_attr_md_t userDescAttrMd;
            ble_gatts_attr_md_t cccdAttrMd;
            ble_gatts_attr_t charValueAttr;
            ble_gatts_char_handles_t charHandles;
            int ret = toPlatformUUID(uuid, &charUuid);
            CHECK_RETURN(ret, nullptr);
            memset(&charMd, 0, sizeof(charMd));
            toPlatformCharProps(properties, &charMd.char_props);
            // User Description Descriptor attribute metadata
            if (desc != nullptr) {
                memset(&userDescAttrMd, 0, sizeof(userDescAttrMd));
                BLE_GAP_CONN_SEC_MODE_SET_OPEN(&userDescAttrMd.read_perm);
                BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&userDescAttrMd.write_perm);
                userDescAttrMd.vloc = BLE_GATTS_VLOC_STACK;
                userDescAttrMd.rd_auth = 0;
                userDescAttrMd.wr_auth = 0;
                userDescAttrMd.vlen = 0;
                charMd.p_char_user_desc = (const uint8_t *)desc;
                charMd.char_user_desc_max_size = strlen(desc);
                charMd.char_user_desc_size = strlen(desc);
                charMd.p_user_desc_md = &userDescAttrMd;
            }
            else {
                charMd.p_char_user_desc = nullptr;
                charMd.p_user_desc_md = nullptr;
            }
            // Client Characteristic Configuration Descriptor attribute metadata
            if (charMd.char_props.notify || charMd.char_props.indicate) {
                memset(&cccdAttrMd, 0, sizeof(cccdAttrMd));
                BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.read_perm);
                BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.write_perm);
                cccdAttrMd.vloc = BLE_GATTS_VLOC_STACK;
                charMd.p_cccd_md = &cccdAttrMd;
            }
            // TODO:
            charMd.p_char_pf = nullptr;
            charMd.p_sccd_md = nullptr;
            // Characteristic value attribute metadata
            memset(&valueAttrMd, 0, sizeof(valueAttrMd));
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
            valueAttrMd.vloc = BLE_GATTS_VLOC_USER;
            valueAttrMd.rd_auth = 0;
            valueAttrMd.wr_auth = 0;
            valueAttrMd.vlen = 1;
            // Characteristic value attribute
            uint8_t* charValue = (uint8_t*)pool_.alloc(BLE_MAX_ATTR_VALUE_PACKET_SIZE);
            if (charValue == nullptr) {
                return SYSTEM_ERROR_NO_MEMORY;
            }
            memset(&charValueAttr, 0, sizeof(charValueAttr));
            charValueAttr.p_uuid = &charUuid;
            charValueAttr.p_attr_md = &valueAttrMd;
            charValueAttr.init_len = 0;
            charValueAttr.init_offs = 0;
            charValueAttr.max_len = BLE_MAX_ATTR_VALUE_PACKET_SIZE;
            charValueAttr.p_value = charValue;
            ret = sd_ble_gatts_characteristic_add(svcHandle, &charMd, &charValueAttr, &charHandles);
            if (ret != NRF_SUCCESS) {
                pool_.free(charValue);
                NRF_CHECK_RETURN(ret, "sd_ble_gatts_characteristic_add");
            }
            BleCharacteristic characteristic;
            characteristic.properties = properties;
            characteristic.svcHandle = svcHandle;
            characteristic.handles.decl_handle = charHandles.value_handle - 1;
            characteristic.handles.value_handle = charHandles.value_handle;
            characteristic.handles.user_desc_handle = charHandles.user_desc_handle;
            characteristic.handles.cccd_handle = charHandles.cccd_handle;
            characteristic.handles.sccd_handle = charHandles.sccd_handle;
            characteristics_.append(characteristic);
            *handles = characteristic.handles;
            LOG_DEBUG(TRACE, "Characteristic value handle: %d.", charHandles.value_handle);
            LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", charHandles.cccd_handle);
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_NOT_FOUND;
        }
    }

    int addDescriptor(uint16_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, uint16_t len, uint16_t* handle) {
        if (uuid == nullptr || descriptor== nullptr || handle == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (findCharacteristic(charHandle)) {
            ble_gatts_attr_t descAttr;
            ble_gatts_attr_md_t descAttrMd;
            ble_uuid_t descUuid;
            int ret = toPlatformUUID(uuid, &descUuid);
            CHECK_RETURN(ret, nullptr);
            memset(&descAttrMd, 0, sizeof(descAttrMd));
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descAttrMd.read_perm);
            BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&descAttrMd.write_perm);
            descAttrMd.vloc = BLE_GATTS_VLOC_STACK;
            descAttrMd.rd_auth = 0;
            descAttrMd.wr_auth = 0;
            descAttrMd.vlen    = 0;
            memset(&descAttr, 0, sizeof(descAttr));
            descAttr.p_uuid    = &descUuid;
            descAttr.p_attr_md = &descAttrMd;
            descAttr.init_len  = len;
            descAttr.init_offs = 0;
            descAttr.max_len   = len;
            descAttr.p_value   = descriptor;
            // FIXME: validate the descriptor to be added
            ret = sd_ble_gatts_descriptor_add(charHandle, &descAttr, handle);
            // TODO: assigne the handle to corresponding characteristic.
            NRF_CHECK_RETURN(ret, "sd_ble_gatts_descriptor_add");
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_NOT_FOUND;
        }
    }

    size_t setValue(uint16_t handle, const uint8_t* buf, size_t len) {
        if (handle == BLE_INVALID_ATTR_HANDLE || buf == NULL) {
            return 0;
        }
        BleCharacteristic* characteristic = findCharacteristic(handle);
        if (characteristic != nullptr && handle == characteristic->handles.value_handle) {
            len = len > BLE_MAX_ATTR_VALUE_PACKET_SIZE ? BLE_MAX_ATTR_VALUE_PACKET_SIZE : len;
            ble_gatts_value_t gattValue;
            gattValue.len = len;
            gattValue.offset = 0;
            gattValue.p_value = (uint8_t*)buf;
            ret_code_t ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, handle, &gattValue);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
                return 0;
            }
            // Notify or indicate the value if possible.
            if ((characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) || (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
                for (int i = 0; i < characteristic->cccdConnections.size(); i++) {
                    if (os_semaphore_create(&hvxSemaphore_, 1, 0)) {
                        LOG(ERROR, "os_semaphore_create() failed");
                        break;
                    }
                    ble_gatts_hvx_params_t hvxParams;
                    uint16_t hvxLen = len;
                    if (characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) {
                        hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
                    }
                    else if (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE) {
                        hvxParams.type = BLE_GATT_HVX_INDICATION;
                    }
                    hvxParams.handle = handle;
                    hvxParams.offset = 0;
                    hvxParams.p_data = buf;
                    hvxParams.p_len = &hvxLen;
                    ret_code_t ret = sd_ble_gatts_hvx(characteristic->cccdConnections[i], &hvxParams);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
                        os_semaphore_destroy(hvxSemaphore_);
                        break;
                    }
                    if (os_semaphore_take(hvxSemaphore_, BLE_GENERAL_PROCEDURE_TIMEOUT, false)) {
                        os_semaphore_destroy(hvxSemaphore_);
                        break;
                    }
                    os_semaphore_destroy(hvxSemaphore_);
                }
            }
            return len;
        }
        else {
            return 0;
        }
    }

    size_t getValue(uint16_t handle, uint8_t* buf, size_t len) {
        if (handle == BLE_INVALID_ATTR_HANDLE || buf == NULL) {
            return 0;
        }
        BleCharacteristic* characteristic = findCharacteristic(handle);
        if (characteristic != nullptr && handle == characteristic->handles.value_handle) {
            len = len > BLE_MAX_ATTR_VALUE_PACKET_SIZE ? BLE_MAX_ATTR_VALUE_PACKET_SIZE : len;
            ble_gatts_value_t gattValue;
            gattValue.len = len;
            gattValue.offset = 0;
            gattValue.p_value = buf;
            int ret = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, handle, &gattValue);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
                return 0;
            }
            return gattValue.len;
        }
        else {
            return 0;
        }
    }

