particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    class BleCharacteristic {
        public:
            uint8_t properties;
            uint16_t svcHandle;
            hal_ble_char_handles_t handles;
            Vector<uint16_t> cccdConnections;
    };

    os_semaphore_t hvxSemaphore_;                   /**< Semaphore to wait until the HVX operation completed. */
    AtomicAllocedPool pool_;                        /**< Pool to allocate memory for characteristic value. */
    Vector<uint16_t> services_;                     /**< Added services. */
    Vector<BleCharacteristic> characteristics_;   /**< Added characteristic. */

    GattServer() {
        hvxSemaphore_ = nullptr;
        // Allocate additional 512 bytes, since each block will occupy several bytes(12).
        pool_.init(BLE_MAX_CHAR_COUNT * BLE_MAX_ATTR_VALUE_PACKET_SIZE + 512);
        gattsImpl.instance = this;
        NRF_SDH_BLE_OBSERVER(bleGattServer, 1, processGattServerEvents, &gattsImpl);
    }

    ~GattServer() = default;

    bool findService(uint16_t handle) const {
        for (int i = 0; i < services_.size(); i++) {
            const uint16_t& svcHandle = services_[i];
            if (svcHandle == handle) {
                return true;
            }
        }
        return false;
    }

    BleCharacteristic* findCharacteristic(uint16_t handle) {
        for (int i = 0; i < characteristics_.size(); i++) {
            BleCharacteristic& characteristic = characteristics_[i];
            if (characteristic.handles.value_handle == handle ||
                    characteristic.handles.decl_handle == handle ||
                    characteristic.handles.user_desc_handle == handle ||
                    characteristic.handles.cccd_handle == handle ||
                    characteristic.handles.sccd_handle == handle) {
                return &characteristic;
            }
        }
        return nullptr;
    }

    void addToCCCDList(BleCharacteristic* characteristic, uint16_t connHandle) {
        characteristic->cccdConnections.append(connHandle);
    }

    void removeFromCCCDList(BleCharacteristic* characteristic, uint16_t connHandle) {
        for (int i = 0; i < characteristic->cccdConnections.size(); i++) {
            uint16_t& handle = characteristic->cccdConnections[i];
            if (handle == connHandle) {
                characteristic->cccdConnections.removeAt(i);
            }
        }
    }

    void removeFromAllCCCDList(uint16_t connHandle) {
        for (int i = 0; i < characteristics_.size(); i++) {
            BleCharacteristic& characteristic = characteristics_[i];
            removeFromCCCDList(&characteristic, connHandle);
        }
    }

    static void processGattServerEvents(const ble_evt_t* event, void* context) {
        GattServer* gatts = static_cast<GattServerImpl*>(context)->instance;
        HalBleEvtMsg_t msg;
        memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));
        switch (event->header.evt_id) {
            case BLE_GAP_EVT_DISCONNECTED: {
                gatts->removeFromAllCCCDList(event->evt.gap_evt.conn_handle);
            } break;

            case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");
                // No persistent system attributes
                const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
                }
            } break;

            case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request.");

                uint16_t clientMtu = event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
                LOG_DEBUG(TRACE, "Effective Client RX MTU: %d.", clientMtu);

                uint16_t effectMtu = clientMtu > NRF_SDH_BLE_GATT_MAX_MTU_SIZE ? NRF_SDH_BLE_GATT_MAX_MTU_SIZE : clientMtu;
                int ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, effectMtu);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
                }
                LOG_DEBUG(TRACE, "Reply with Server RX MTU: %d.", effectMtu);

                msg.arg.type = BLE_EVT_GATT_PARAMS_UPDATED;
                msg.arg.params.gatt_params_updated.version = 0x01;
                msg.arg.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
                msg.arg.params.gatt_params_updated.att_mtu_size = effectMtu;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            } break;

            case BLE_GATTS_EVT_WRITE: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic, handle: %d, len: %d.",
                        event->evt.gatts_evt.params.write.handle, event->evt.gatts_evt.params.write.len);

                BleCharacteristic* characteristic = gatts->findCharacteristic(event->evt.gatts_evt.params.write.handle);
                if (characteristic != nullptr) {
                    if (characteristic->handles.value_handle == event->evt.gatts_evt.params.write.handle) {
                        // TODO: deal with different write commands.
                        msg.arg.type = BLE_EVT_DATA_WRITTEN;
                        msg.arg.params.data_rec.version = 0x01;
                        msg.arg.params.data_rec.conn_handle = event->evt.gatts_evt.conn_handle;
                        msg.arg.params.data_rec.attr_handle = event->evt.gatts_evt.params.write.handle;
                        msg.arg.params.data_rec.offset = event->evt.gatts_evt.params.write.offset;
                        msg.arg.params.data_rec.data_len = event->evt.gatts_evt.params.write.len;
                        memcpy(msg.arg.params.data_rec.data, event->evt.gatts_evt.params.write.data, msg.arg.params.data_rec.data_len);
                        if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                            LOG(ERROR, "os_queue_put() failed.");
                        }
                    }
                    else if (characteristic->handles.cccd_handle == event->evt.gatts_evt.params.write.handle) {
                        if (event->evt.gatts_evt.params.write.data[0] > 0) {
                            gatts->addToCCCDList(characteristic, event->evt.gatts_evt.conn_handle);
                        }
                        else {
                            gatts->removeFromCCCDList(characteristic, event->evt.gatts_evt.conn_handle);
                        }
                    }
                }
            } break;

            case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
                os_semaphore_give(gatts->hvxSemaphore_, false);
            } break;

