particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            case BLE_GATTS_EVT_HVC: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
                os_semaphore_give(gatts->hvxSemaphore_, false);
            } break;

            case BLE_GATTS_EVT_TIMEOUT: {
                LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);
                // Disconnect on GATT Server timeout event.
                int ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
                }
            } break;

            default: break;
        }
    }
};


static int writeAttribute(uint16_t connHandle, uint16_t attrHandle, const uint8_t* data, uint16_t len, bool response) {
    ble_gattc_write_params_t writeParams;

    if (os_semaphore_create(&s_bleInstance.readWriteSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    }
    else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    writeParams.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle   = attrHandle;
    writeParams.offset   = 0;
    writeParams.len      = len;
    writeParams.p_value  = data;

    ret_code_t ret = sd_ble_gattc_write(connHandle, &writeParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.readWriteSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.readWriteSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.readWriteSemaphore);

    return SYSTEM_ERROR_NONE;
}

/**********************************************
 * Particle BLE APIs
 */
bool ble_stack_is_initialized(void) {
    return s_bleInstance.initialized;
}

int ble_stack_init(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());

    /* The SoftDevice has been enabled in core_hal.c */
    LOG_DEBUG(TRACE, "ble_stack_init().");

    if (!s_bleInstance.initialized) {
        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ramStart = 0;
        ret_code_t ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_default_cfg_set() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        LOG_DEBUG(TRACE, "RAM start: 0x%08x", (unsigned)ramStart);

        // Enable the stack
        ret = nrf_sdh_ble_enable(&ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_enable() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInstance.initialized = true;

        for (uint8_t i = 0; i < BLE_MAX_EVT_CB_COUNT; i++) {
            s_bleInstance.evtCbs[i].handler = NULL;
            s_bleInstance.evtCbs[i].context = NULL;
        }

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(bleObserver, BLE_OBSERVER_PRIO, isrProcessBleEvent, nullptr);

        // Set the default device name
        char devName[32] = {};
        get_device_name(devName, sizeof(devName));
        ble_gap_set_device_name((const uint8_t*)devName, strlen(devName));

        // Initialize BLE Broadcaster.
        Broadcaster::getInstance();
        Observer::getInstance();
        ConnectionsManager::getInstance();

        // Select internal antenna by default
        ble_select_antenna(BLE_ANT_INTERNAL);

        if (os_queue_create(&s_bleInstance.evtQueue, sizeof(HalBleEvtMsg_t), BLE_EVENT_QUEUE_ITEM_COUNT, NULL)) {
            LOG(ERROR, "os_queue_create() failed");
            return SYSTEM_ERROR_NO_MEMORY;
        }

        if (os_thread_create(&s_bleInstance.evtThread, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, handleBleEventThread, NULL, BLE_EVENT_THREAD_STACK_SIZE)) {
            LOG(ERROR, "os_thread_create() failed");
            os_queue_destroy(s_bleInstance.evtQueue, NULL);
            return SYSTEM_ERROR_INTERNAL;
        }

        return SYSTEM_ERROR_NONE;
    }
    else {
        return SYSTEM_ERROR_INVALID_STATE;
    }
}

int ble_select_antenna(hal_ble_ant_type_t antenna) {
#if (PLATFORM_ID == PLATFORM_XENON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM) || (PLATFORM_ID == PLATFORM_BORON_SOM)
    // Mesh SoM don't have on-board antenna switch.
    return SYSTEM_ERROR_NOT_SUPPORTED;
#else
    HAL_Pin_Mode(ANTSW1, OUTPUT);
#if (PLATFORM_ID == PLATFORM_XENON) || (PLATFORM_ID == PLATFORM_ARGON)
    HAL_Pin_Mode(ANTSW2, OUTPUT);
#endif

    if (antenna == BLE_ANT_EXTERNAL) {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 0);
#else
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#endif
    }
    else {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 1);
#else
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#endif
    }
    return SYSTEM_ERROR_NONE;
#endif // (PLATFORM_ID == PLATFORM_XENON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM)
}

int ble_set_callback_on_events(on_ble_evt_cb_t callback, void* context) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    for (uint8_t i = 0; i < BLE_MAX_EVT_CB_COUNT; i++) {
        if (s_bleInstance.evtCbs[i].handler == NULL) {
            s_bleInstance.evtCbs[i].handler = callback;
            s_bleInstance.evtCbs[i].context = context;
            break;
        }
    }

    return SYSTEM_ERROR_NONE;
}


/**********************************************
 * BLE GAP APIs
 */
int ble_gap_set_device_address(const hal_ble_addr_t* address) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_device_address().");

    if (address == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (address->addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && address->addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (Broadcaster::getInstance().advertising() ||
            Observer::getInstance().scanning() ||
            ConnectionsManager::getInstance().connecting()) {
        // The identity address cannot be changed while advertising, scanning or creating a connection.
        return SYSTEM_ERROR_INVALID_STATE;
    }

    ble_gap_addr_t localAddr;
    localAddr.addr_id_peer = false;
    localAddr.addr_type    = address->addr_type;
    memcpy(localAddr.addr, address->addr, BLE_SIG_ADDR_LEN);

