particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    return Broadcaster::getInstance().getScanResponseData(buf, len);
}

int ble_gap_start_advertising(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_advertising().");

    return Broadcaster::getInstance().startAdvertising();
}

int ble_gap_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_advertising().");

    return Broadcaster::getInstance().stopAdvertising();
}

bool ble_gap_is_advertising(void) {
    return Broadcaster::getInstance().advertising();
}

int ble_gap_set_scan_parameters(const hal_ble_scan_params_t* scan_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");

    return Observer::getInstance().setScanParams(scan_params);
}

int ble_gap_get_scan_parameters(hal_ble_scan_params_t* scan_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");

    return Observer::getInstance().getScanParams(scan_params);
}

int ble_gap_start_scan(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_scan().");

    return Observer::getInstance().startScanning(false);
}

bool ble_gap_is_scanning(void) {
    return Observer::getInstance().scanning();
}

int ble_gap_stop_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_scan().");

    return Observer::getInstance().stopScanning();
}

int ble_gap_connect(const hal_ble_addr_t* address, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect().");

    return ConnectionsManager::getInstance().connect(address);
}

bool ble_gap_is_connecting(void) {
    return ConnectionsManager::getInstance().connecting();
}

bool ble_gap_is_connected(const hal_ble_addr_t* address) {
    return ConnectionsManager::getInstance().connected(address);
}

int ble_gap_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect_cancel().");

    return ConnectionsManager::getInstance().connectCancel();
}

int ble_gap_disconnect(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_disconnect().");

    return ConnectionsManager::getInstance().disconnect(conn_handle);
}

int ble_gap_update_connection_params(uint16_t conn_handle, const hal_ble_conn_params_t* conn_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");

    return ConnectionsManager::getInstance().updateConnectionParams(conn_handle, conn_params);
}

int ble_gap_get_connection_params(uint16_t conn_handle, hal_ble_conn_params_t* conn_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");

    return ConnectionsManager::getInstance().getConnectionParams(conn_handle, conn_params);
}

int ble_gap_get_rssi(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_get_rssi().");

    return 0;
}


/**********************************************
 * BLE GATT Server APIs
 */
int ble_gatt_server_add_service(uint8_t type, const hal_ble_uuid_t* uuid, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_service().");

    return GattServer::getInstance().addService(type, uuid, handle);
}

int ble_gatt_server_add_characteristic(const hal_ble_char_init_t* char_init, hal_ble_char_handles_t* handles, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic().");

    return GattServer::getInstance().addCharacteristic(char_init->service_handle, char_init->properties, &char_init->uuid, char_init->description, handles);
}

int ble_gatt_server_add_descriptor(const hal_ble_desc_init_t* desc_init, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_descriptor().");

    return GattServer::getInstance().addDescriptor(desc_init->char_handle, &desc_init->uuid, desc_init->descriptor, desc_init->len, handle);
}

size_t ble_gatt_server_set_characteristic_value(uint16_t value_handle, const uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_set_characteristic_value().");

    return GattServer::getInstance().setValue(value_handle, buf, len);
}

size_t ble_gatt_server_get_characteristic_value(uint16_t value_handle, uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_get_characteristic_value().");

    return GattServer::getInstance().getValue(value_handle, buf, len);
}


/**********************************************
 * BLE GATT Client APIs
 */
int ble_gatt_client_discover_all_services(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_all_services().");

